In [203]:
import pandas as pd
import calendar
import numpy as np
from time import strptime

In [204]:
data={'A':['Abril','Mayo','Junio','Enero','Abril']}

df=pd.DataFrame(data)
df

       A
0  Abril
1   Mayo
2  Junio
3  Enero
4  Abril

In [205]:
m=list(df['A'])
m

['Abril', 'Mayo', 'Junio', 'Enero', 'Abril']

In [207]:
m={
        'Enero':'01',
        'Febrero':'02',
        'Marzo':'03',
        'Abril':'04',
        'Mayo':'05',
        'Junio':'06',
        'Julio':'07',
        'Agosto':'08',
        'Septiembre':'09',
        'Octubre':'10',
        'Noviembre':'11',
        'Diciembre':'12'
    }

new=np.array([m[x] for x in df['A'].values])
new

array(['04', '05', '06', '01', '04'], dtype='<U2')

In [208]:
df['mes_mun']=new
df['anio']=[2018,2018,2016,2017,2016]

In [209]:
df.head()

       A mes_mun  anio
0  Abril      04  2018
1   Mayo      05  2018
2  Junio      06  2016
3  Enero      01  2017
4  Abril      04  2016

In [187]:
#df2=df.sort_values(by=['anio','mes_mun'])

In [210]:
df2['nuevo']=df2['anio'].astype(str)+df2['mes_mun'].astype(str)
df2['nuevo']=df2['nuevo'].astype('int')
df2

       A mes_mun  anio   nuevo
4  Abril      04  2016  201604
2  Junio      06  2016  201606
3  Enero      01  2017  201701
0  Abril      04  2018  201804
1   Mayo      05  2018  201805

In [201]:
df3=df2.loc[df2['nuevo']<=201607]
df4=df2.loc[df2['nuevo']>201607]
df3

       A mes_mun  anio   nuevo
4  Abril      04  2016  201604
2  Junio      06  2016  201606

In [202]:
df4

       A mes_mun  anio   nuevo
3  Enero      01  2017  201701
0  Abril      04  2018  201804
1   Mayo      05  2018  201805

In [200]:
criterio=df2['nuevo']<=201604
df5=df[criterio]
df5

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

       A mes_mun  anio
4  Abril      04  2016

In [ ]:
df6=df[criterio]
df6